Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Warning: SendPlay doesn't tend to work on modern systems unless you run with UI access.
ja: 警告：SendPlayは、UIアクセスで実行しない限り、最新のシステムで動作しない傾向があります。

source: Warning: SendPlay may have no effect at all if UAC is enabled, even if the script is running as an administrator.
ja: 警告SendPlayは、UACが有効な場合、スクリプトが管理者として実行されていても、全く効果がない場合があります。

source: Warning:
ja: 警告します：

source: What: What threw the exception.
ja: What：何が例外を発生させたか。

source: WhichButton: Left (default), Right, Middle (or just the first letter of each of these); or the fourth or fifth mouse button (X1 or X2).
ja: WhichButton左（デフォルト）、右、中（またはそれぞれの最初の文字）、またはマウスの4番目か5番目のボタン（X1またはX2）。

source: Width: A decimal integer which controls the minimum width of the formatted value, in characters.
ja: Width：フォーマットされた値の最小幅を制御する10進数の整数（文字数）。

source: Wildcard: The dot-star pattern .* is one of the most permissive because it matches zero or more occurrences of any character (except newline:
ja: ワイルドカード：ドットスターパターン.*は、0個以上の任意の文字（改行 `r と `n を除く）にマッチするため、最も寛容なパターンの1つである。

source: Wildcard: The dot-star pattern .* is one of the most permissive because it matches zero or more occurrences of any character (except newline: `r and `n).
ja: ワイルドカード：ドットスターパターン.*は、0個以上の任意の文字（改行 `r と `n を除く）にマッチするため、最も寛容なパターンの1つである。

source: Window: Coordinates are relative to the active window.
ja: Window：座標は、アクティブウィンドウからの相対座標です。

source: Windows 10 replaces all balloon windows with toast notifications by default (this can be overridden via group policy).
ja: Windows 10では、デフォルトですべてのバルーンウィンドウがトースト通知に置き換えられる（グループポリシーで上書き可能）。

source: Wn Hn: The width and height of the dialog's client area, which excludes the title bar and borders.
ja: Wn Hn：タイトルバーとボーダーを除いたダイアログのクライアント領域の幅と高さを指定します。

source: Wrap: Causes the control to wrap around to the other end of its range when the user attempts to go beyond the minimum or maximum.
ja: Wrap：ユーザーが最小値または最大値を超えようとしたときに、コントロールがその範囲のもう一方の端に回り込むようにする。

source: Wrap: Enables word-wrapping of the control's contents within its available width.
ja: Wrap：コントロールの内容を使用可能な幅の範囲内でワードラッピングすることができるようにします。

source: X-Y: Each of these is a pair of X/Y coordinates.
ja: X-Y：それぞれX/Y座標のペア。

source: X: Execute.
ja: X：実行。

source: Xn and Yn: The X and Y coordinates of the dialog.
ja: Xn、Yn：ダイアログのX、Y座標を指定します。

source: Xn: Specify for n the X position to click at, relative to the control's upper left corner.
ja: Xn：コントロールの左上隅を基準として、クリックする X 位置をnに指定します。

source: Xn: Specify for n the window's X-position on the screen, in pixels.
ja: Xn：画面上のウィンドウの X 位置をnにピクセル単位で指定します。

source: Xn Yn: The X and Y coordinates of the dialog.
ja: Xn Yn: ダイアログのX、Y座標を指定します。

source: Yn: Specify for n the Y position to click at, relative to the control's upper left corner.
ja: Yn：コントロールの左上隅を基準として、クリックするY位置をnに指定します。

source: Yn: Specify for n the window's Y-position on the screen, in pixels.
ja: Yn：画面上のウィンドウの Y 位置をピクセル単位でnに指定します。

source: Z: This rarely-used option resets the hotstring recognizer after each triggering of the hotstring.
ja: Z：このオプションはほとんど使用されませんが、ホットストリングがトリガーされるたびに、ホットストリング認識装置をリセットします。

source: Z: To understand this option, consider a variable that contains "RED`nGREEN`nBLUE`n".
ja: Z：このオプションを理解するために、"RED`nGREEN`nBLUE`n"を含む変数を考えてみよう。

source: ZeroDivisionError: Division by zero was attempted in an expression or with the Mod function.
ja: ZeroDivisionError：式やMod関数でゼロによる除算を試みた。

source: \: Sorts items based on the substring that follows the last backslash in each.
ja: \：各項目の最後のバックスラッシュに続く部分文字列に基づいて項目をソートします。

source: \R matches `r`n, `n and `r (however, \R inside a character class is merely the letter "R").
ja: \R は、`r`n、`n、`rにマッチする（ただし、文字クラス内では単に「R」となる）。

source: \b means "word boundary", which is like an anchor because it doesn't consume any characters.
ja: \b は「単語の境界」を意味し、文字を消費しないのでアンカーのようなものだ。

source: \p{xx} matches a character with the xx property while \P{xx} matches any character without the xx property.
ja: \p{xx}はxx プロパティを持つ文字にマッチしますが、\P{xx}は xx プロパティを持たない任意の文字にマッチします。

source: ^ may appear at the beginning of a pattern to require the match to occur at the very beginning of a line.
ja: ^ は、行の先頭でマッチすることを要求するために、パターンの先頭に現れることがある。

source: ` (accent): Treats each backtick character literally rather than as an escape character.
ja: `（アクセント）：各バックティック文字をエスケープ文字としてではなく、文字通りに扱う。

source: `n (a linefeed character):
ja: `n(改行文字)：

source: `n (a linefeed character): Inserts a carriage return (`r) before each linefeed (`n) if one is not already present.
ja: `n（改行文字）：キャリッジリターン（`r）がまだ存在しない場合、各ラインフィード（`n）の前に挿入されます。

source: `n (a linefeed character): Replaces any/all occurrences of carriage return & linefeed (`r`n) with linefeed (`n).
ja: `n（改行文字）：キャリッジリターンとラインフィード（`r`n）をラインフィード（`n）に置き換える。

source: a) Accompany it with the complete corresponding machine-readable source code, which must be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or,
ja: a) 対応する機械可読のソースコード一式を添付する。このソースコードは、ソフトウェアの交換に慣用的に使用される媒体上で、上記第1項および第2項の条件に従って頒布されなければならない、

source: a) You must cause the modified files to carry prominent notices stating that you changed the files and the date of any change.
ja: a) あなたは、変更されたファイルに、あなたがファイルを変更したこと、および変更の日付を記載した目立つ通知を表示させなければなりません。

source: ac: For developing #Warn.
ja: ac：発展途上国向け #警告。

source: b) Accompany it with a written offer, valid for at least three years, to give any third party, for a charge no more than your cost of physically performing source distribution, a complete machine-readable copy of the corresponding source code, to be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or,
ja: b) 少なくとも3年間有効な書面による申し出を添付し、いかなる第三者に対しても、物理的にソースの配布を実行するコストを超えない料金で、対応するソースコードの完全な機械可読コピーを、ソフトウェアの交換に慣習的に使用される媒体上で、上記第1項および第2項の条件に従って配布すること、

source: b) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.
ja: b)あなたが頒布または公表する、『プログラム』またはその一部分を含むか またはそれらから派生した著作物の全部または一部は、本許諾書の条項 に従い、すべての第三者に対して全体として無償で利用許諾されなければな らない。

source: bold, italic, strike, underline, and norm.
ja: bold, italic, strike, underline, および norm.

source: c) Accompany it with the information you received as to the offer to distribute corresponding source code.
ja: c)あなたが受け取った、対応するソースコードの配布の申し出に関する情報を添付すること。

source: c) If the modified program normally reads commands interactively when run, you must cause it, when started running for such interactive use in the most ordinary way, to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License.
ja: c) 改変されたプログラムが通常実行時に対話的にコマンドを読み込むものであ る場合、そのような対話的使用のためにごく普通の方法で実行を開始する際 に、適切な著作権表示と保証がないこと(あるいはあなたが保証を提供する旨)、そしてユ ーザーはこれらの条件の下でプログラムを再配布してもよいこと、そして本許諾 書の複製を閲覧する方法をユーザーに伝えることを含む告知を印刷あるいは表 示させなければならない。

source: fincs: For developing native 64-bit support and try/catch/throw, writing a replacement for the old compiler, analyzing and fixing bugs.
ja: fincs：64ビットのネイティブ・サポートとtry/catch/throwの開発、古いコンパイラの置き換え、バグの分析と修正。

source: jackeiku: For developing Unicode support and other new functionality.
ja: jackeiku：Unicodeのサポートやその他の新機能の開発のため。

source: jackieku: For developing Unicode support and other new functionality.
ja: jackieku：Unicodeのサポートやその他の新機能の開発のため。

source: m1024: If this option is omitted, the entire file is loaded unless there is insufficient memory, in which case an error message is shown and the thread exits (but Try can be used to avoid this).
ja: m1024：このオプションを省略すると、メモリ不足でない限りファイル全体が読み込まれ、その場合はエラーメッセージが表示されてスレッドが終了します（ただし、Tryを使用することでこれを回避できます）。

source: wp+n, hp+n, wp-n, hp-n (where n is any number) can be used to set the width and/or height of a control equal to the previously added control's width or height, with an optional plus or minus adjustment.
ja: wp+n、hp+n、wp-n、hp-n（nは任意の数値）は、コントロールの幅や高さを、先に追加したコントロールの幅や高さと同じにするために使用し、オプションでプラスまたはマイナスを調整することができます。

source: x+n, y+n (where n is any number):
ja: x+n、y+n（nは任意の数）：

source: xCenter: Centers the window horizontally on the screen.
ja: xCenter：画面上でウィンドウを水平方向にセンタリングします。

source: xm and ym can be used to position a control at the leftmost and topmost margins of the window, respectively (these two may also be followed by a plus/minus sign and a number).
ja: xmと ymは、それぞれウィンドウの左端と上端のマージンにコントロールを配置するために使用します（この2つの後にプラス/マイナス記号と数字を付けることもできます）。

source: xp+n, yp+n, xp-n, yp-n (where n is any number) can be used to position controls relative to the previous control's upper left corner, which is often useful for enclosing controls in a GroupBox.
ja: xp+n、yp+n、xp-n、yp-n（nは任意の数値）は、前のコントロールの左上隅を基準としてコントロールを配置するために使用でき、これはGroupBoxでコントロールを囲む場合によく使用されます。

source: xs and ys may optionally be followed by a plus/minus sign and a number.
ja: xsとysの後には、オプションでプラス・マイナス記号と数字を付けることができます。

source: xs and ys:
ja: xsと ys：

source: yCenter: Centers the window vertically on the screen.
ja: yCenter：画面上でウィンドウを縦方向にセンタリングします。

source: A_MouseDelayPlay contains the current setting for SendPlay mode.
ja: A_MouseDelayPlayには、SendPlay モードの現在の設定が含まれます。

source: Do not include modifier symbols.
ja: 修飾語記号は含めないでください。

source: Message includes an error code and description generated by the operating system.
ja: メッセージには、オペレーティングシステムによって生成されたエラーコードと説明が含まれます。

source: Message indicates what kind of target, such as a window, control, menu or status bar.
ja: メッセージは、ウィンドウ、コントロール、メニュー、ステータスバーなど、どのような対象であるかを示します。

source: R is often preferable to specifying H (Height).
ja: H（高さ）を指定するよりも、Rを指定した方が好ましい場合が多い。

source: Z (has Z axis), R (has R axis), U (has U axis), V (has V axis), P (has POV control), D (the POV control has a limited number of discrete/distinct settings), C (the POV control is continuous/fine).
ja: Z（Z軸を持つ）、R（R軸を持つ）、U（U軸を持つ）、V（V軸を持つ）、P（POVコントロールを持つ）、D（POVコントロールは離散的／明確な設定が限られている）、C（POVコントロールは連続／微細である）。

source: \b is used to exclude incomplete words in matches such as The quic, The qui, The qu, etc.
ja: \bは、The quic、The qui、The quなどのマッチで、不完全な単語を除外するために使用されます。

source: global DataDir := Dir ; Declaration combined with assignment, described below.
ja: global DataDir := Dir ; 後述するアサインメントと組み合わせた宣言を行います。

source: -()[]{}':;"/\,.?!`n `t (note that `n is Enter, `t is Tab, and there is a plain space between `n and `t).
ja: -()[]{}':;"/\,.?!`n `t (`n は Enter, `t は Tab, そして `n と `t の間には空白がある).

source: -()[]{}':;"/\,.?!`n`s`t (note that `n is Enter, `s is Space, and `t is Tab).
ja: -()[]{}':;"/\,.?!`n`s`t（`nはEnter、`sはSpace、`tはTabです。

source: Known limitation: If Dest already exists as a folder and it is on the same volume as Source, Source will be moved into it rather than overwriting it.
ja: 既知の制限事項： Destがすでにフォルダとして存在し、それがSourceと同じボリュームにある場合、Sourceは上書きされるのではなく、その中に移動されます。

source: R is valid only when W and H are present.
ja: Rは、Wと Hが存在する場合にのみ有効である。

source: Note: !A produces a different effect in some programs than !a.
ja: 注：プログラムによっては、!Aは !aとは異なる効果をもたらす。

source: \X matches any number of characters that form an extended Unicode sequence.
ja: \Xは、Unicode シーケンスを形成する任意の数の文字にマッチします。

source: (?=...) is called a positive look-ahead because it requires that the specified pattern exist.
ja: (?=...)は、指定されたパターンが存在することを要求するため、正のルックアヘッドと呼ばれる。

source: Note: ^A produces a different effect in some programs than ^a.
ja: 注： ^A はプログラムによっては ^a とは異なる効果をもたらします。

source: The button to click:
ja: クリックするボタンです：

source: WhichButton can also be WheelUp or WU to turn the wheel upward (away from you), or WheelDown or WD to turn the wheel downward (toward you).
ja: WhichButtonには、ホイールを上方向（自分から離れる方向）に向けるWheelUpまたはWU、ホイールを下方向（自分から近づく方向）に向けるWheelDownまたはWDを指定することも可能です。

source: WinTitle Parameter & Last Found Window
ja: WinTitleパラメータと最後に見つかったウィンドウ

source: A (Active Window)
ja: A（アクティブウィンドウ）

source: A 0 (zero) value can by default safely be taken as 'no error' (use it with SendMessage).
ja: 0（ゼロ）値は、デフォルトでは「エラーなし」と考えて差し支えない（SendMessageで使用する）。

source: A 0 (zero) value can by default safely be taken as 'no error'.
ja: 0（ゼロ）値は、デフォルトでは「エラーなし」と考えて差し支えない。

source: A 16-bit integer, whose range is -32768 (-0x8000) to 32767 (0x7FFF).
ja: 16ビットの整数で、範囲は-32768（-0x8000）～32767（0x7FFF）です。

source: A 32-bit floating point number, which provides 6 digits of precision.
ja: 32ビット浮動小数点数で、6桁の精度を持つ。

source: A 32-bit integer (the most common integer type), whose range is -2147483648 (-0x80000000) to 2147483647 (0x7FFFFFFF).
ja: 32ビット整数（最も一般的な整数型）で、その範囲は-2147483648（-0x80000000）～2147483647（0x7FFFFFFFF）です。

source: A 32-bit integer.
ja: 32ビット整数です。

source: A 64-bit floating point number, which provides 15 digits of precision.
ja: 64ビットの浮動小数点数で、15桁の精度を持つ。

source: A 64-bit integer, whose range is -9223372036854775808 (-0x8000000000000000) to 9223372036854775807 (0x7FFFFFFFFFFFFFFF).
ja: 64ビット整数で、範囲は-9223372036854775808（-0x800000000000）～9223372036854775807（0x7FFFFFFFFFFFF）です。

source: A 64-bit operation is performed and the result is a 64-bit signed integer.
ja: 64 ビット演算が実行され、結果は64ビット符号付き整数になります。

source: A Buffer-like object containing the string, or the memory address of the string.
ja: 文字列を含むBufferのようなオブジェクト、または文字列のメモリアドレス。

source: A Buffer-like object may be passed to append raw binary data.
ja: Bufferのようなオブジェクトを渡して、生のバイナリデータを付加することができる。

source: A Buffer-like object or a pure integer which is the address of the binary data.
ja: Bufferのようなオブジェクト、またはバイナリデータのアドレスである純粋な整数。

source: A Buffer-like object or memory address to which the string will be written.
ja: 文字列が書き込まれるバッファのようなオブジェクトまたはメモリアドレス。

source: A Buffer-like object or memory address.
ja: Bufferのようなオブジェクトまたはメモリアドレス。

source: A Buffer-like object or string containing binary data, or a memory address.
ja: バイナリデータを含むBufferのようなオブジェクトまたは文字列、またはメモリアドレス。

source: A CLSID folder such as "::{20d04fe0-3aea-1069-a2d8-08002b30309d}" (i.e. My Computer) may be specified start navigation at a specific special folder.
ja: CLSIDフォルダを "::{20d04fe0-3aea-1069-a2d8-08002b30309d}"（例：マイコンピュータ）のように指定すると、特定の特殊フォルダでナビゲーションが開始されることがあります。

source: A Func or Closure object, which represents an actual function; either built-in or defined by the script.
ja: FuncまたはClosureオブジェクトで、実際の関数を表す。

source: A Gui is closed or destroyed.
ja: Guiが閉じられたり、破壊されたりします。

source: A Loop statement (Loop, While or For) executes its body repeatedly.
ja: ループ文（Loop、While、または、For）は、その本体を繰り返し実行します。

source: A Map or associative array is an object which contains a collection of unique keys and a collection of values, where each key is associated with one value.
ja: Mapまたは連想配列は、一意のキーと値のコレクションを含むオブジェクトで、各キーは1つの値と関連付けられています。

source: A MemoryError is thrown if the memory could not be allocated, such as if ByteCount is unexpectedly large or the system is low on virtual memory.
ja: ByteCountが予想外に大きい場合や、システムの仮想メモリが不足している場合など、メモリを確保できなかった場合はMemoryErrorがスローされます。

source: A MemoryError is thrown if the memory could not be allocated, such as if NewByteCount is unexpectedly large or the system is low on virtual memory.
ja: NewByteCountが予想外に大きい場合や、システムの仮想メモリが不足している場合など、メモリを確保できなかった場合はMemoryErrorがスローされます。

source: A PropertyError is thrown if Obj does not own a property by that name.
ja: Objがその名前のプロパティを所有していない場合、PropertyErrorが投げられる。

source: A TargetError is thrown if Replacement is omitted and String is valid but does not match an existing hotstring.
ja: Replacementが省略され、Stringが有効であるが既存のホットストリングと一致しない場合、TargetErrorがスローされます。

source: A TargetError is thrown if the device or component could not be found or if the component does not support this control type.
ja: デバイスまたはコンポーネントが見つからないときや、コンポーネントがコントロールをサポートしていないときは、TargetErrorがスローされます。

source: A TargetError is thrown if the device or component could not be found.
ja: デバイスまたはコンポーネントが見つからないときは、TargetErrorがスローされます。

source: A TargetError is thrown if the process could not be found.
ja: プロセスが見つからなかった場合、TargetErrorがスローされます。

source: A TargetError is thrown if the specified process could not be found.
ja: 指定されたプロセスが見つからない場合、TargetErrorが投げられます。

source: A TargetError is thrown if the target window could not be found or does not contain a standard status bar.
ja: ターゲットウィンドウが見つからない、または標準のステータスバーが含まれていないときは、TargetErrorがスローされます。

source: A TargetError is thrown if the window could not be found, except if the group mode is used.
ja: グループモードが使用されている場合を除き、ウィンドウが見つからなかった場合はTargetErrorがスローされます。

source: A TargetError is thrown if the window could not be found.
ja: ウィンドウが見つからないときは、TargetErrorがスローされます。

source: A TargetError is thrown if the window or control could not be found, or does not have a standard Win32 menu.
ja: ウィンドウやコントロールが見つからなかったり、Win32標準のメニューがない場合は、TargetErrorがスローされます。

source: A TargetError is thrown if the window or control could not be found, or if the control's class name does not contain "Combo" or "List".
ja: ウィンドウまたはコントロールが見つからないときや、コントロールのクラス名に「Combo」または「List」が含まれないときは、TargetErrorがスローされます。

source: A TargetError is thrown if the window or control could not be found, or if the control's class name does not contain "Combo", "List" or "Tab".
ja: ウィンドウまたはコントロールが見つからない場合、またはコントロールのクラス名に「Combo」、「List」、「Tab」が含まれない場合、TargetErrorが発生します。

source: A TargetError is thrown if the window or control could not be found.
ja: ウィンドウまたはコントロールが見つからないときは、TargetErrorがスローされます。

source: A TargetError is thrown if there is a problem determining the target window or control.
ja: ターゲットとなるウィンドウやコントロールの決定に問題がある場合、TargetErrorがスローされます。

source: A TimeoutError is thrown if the message timed out.
ja: メッセージがタイムアウトした場合、TimeoutErrorが投げられます。

source: A TypeError is thrown if ComObj is not a COM wrapper object.
ja: ComObjがCOMラッパーオブジェクトでない場合、TypeErrorが投げられる。

source: A ValueError is thrown if Index is less than -ArrayObj.Length or greater than ArrayObj.Length + 1.
ja: Indexが-ArrayObj.Lengthよりも小さいか、ArrayObj.Length + 1よりも大きい場合はValueErrorがスローされます。

source: A ValueError is thrown if Index is out of range.
ja: Indexが範囲外の場合、ValueErrorが投げられる。

source: A ValueError is thrown if N is out of range or otherwise invalid.
ja: Nが範囲外であるなど無効である場合にはValueErrorが投げられます。

source: A ValueError is thrown if a menu, submenu or menu item could not be found, or if the final menu parameter corresponds to a menu item which opens a submenu.
ja: メニュー、サブメニュー、メニューアイテムが見つからない場合、または最後のメニューパラメータがサブメニューを開くメニューアイテムに対応する場合、ValueErrorがスローされます。

source: A ValueError is thrown if an invalid parameter was detected or the image could not be loaded.
ja: 無効なパラメータが検出された場合、または画像を読み込むことができなかった場合、ValueErrorがスローされます。

source: A ValueError is thrown if invalid parameters are detected, such as if the converted string would be longer than allowed by Length or Target.Size.
ja: 変換後の文字列がLengthや Target.Sizeで許容される長さよりも長い場合など、無効なパラメータが検出された場合はValueErrorがスローされます。

source: A ValueError is thrown if invalid parameters are detected.
ja: 無効なパラメータが検出された場合はValueErrorがスローされる。

source: A ValueError is thrown if one or more Options are invalid, or if more than 2000 pairs of coordinates were specified.
ja: 1つ以上のオプションが無効な場合、または2000組以上の座標が指定された場合、ValueErrorがスローされます。

source: A ValueError is thrown if the ColN option specifies a nonexistent column.
ja: ColNオプションで存在しないカラムを指定した場合、ValueErrorが投げられます。

source: A ValueError is thrown if the range indicated by Index and Length is not entirely within the array's current bounds.
ja: Indexと Lengthで示される範囲が、配列の現在の範囲に完全に収まっていない場合、ValueErrorがスローされます。

source: A ValueError is thrown in any of the following cases:
ja: 以下のいずれかに該当する場合、ValueErrorが発生します：

source: A ValueError or MethodError is thrown if validation fails.
ja: バリデーションに失敗した場合、ValueErrorまたはMethodErrorがスローされます。

source: A bitmap or icon handle can be used instead of a filename.
ja: ファイル名の代わりにビットマップやアイコンハンドルを使うこともできる。

source: A block (denoted by a pair of braces) groups zero or more statements to act as a single statement.
ja: ブロック（中括弧のペア）は、0個以上のステートメントをグループ化して、1つのステートメントとして動作させるものです。

source: A closure or bound function can be used to differentiate between multiple callbacks which all call the same script function.
ja: クロージャまたはバウンド関数は、同じスクリプト関数をすべて呼び出す複数のコールバックを区別するために使用することができます。

source: A critical thread becomes interruptible when a MsgBox or other dialog is displayed.
ja: MsgBoxなどのダイアログが表示されると、クリティカル・スレッドが割り込み可能になる。

source: A fat arrow expression defines a function which evaluates an expression and returns its result, instead of executing a block of code.
ja: ファットアロー式は、コードのブロックを実行する代わりに、式を評価してその結果を返す関数を定義します。

source: A function definition combining a name, parentheses and a block of code.
ja: 名前、括弧、コードのブロックを組み合わせた関数定義です。

source: A function object to call as a new thread when the menu item is selected, or a reference to a Menu object to use as a submenu.
ja: メニュー項目が選択されたときに新しいスレッドとして呼び出す関数オブジェクト、またはサブメニューとして使用するMenuオブジェクトへのリファレンス。

source: A function assigned to a callback address may accept up to 31 parameters.
ja: コールバックアドレスに割り当てられた関数は、最大31個のパラメータを受け取ることができます。

source: A function assigned to monitor one or more messages should accept four parameters:
ja: 1つまたは複数のメッセージを監視するために割り当てられた関数は、4つのパラメータを受け入れる必要があります：

source: A hotkey or hotstring definition, combining a hotkey or hotstring with a single statement or a block of code.
ja: ホットキーまたはホットストリングの定義で、ホットキーまたはホットストリングを1つのステートメントまたはコードのブロックと組み合わせたものです。

source: A hotstring is given a specific priority when it is defined, or via the #Hotstring directive.
ja: ホットストリングは、定義されたとき、または#Hotstringディレクティブによって特定の優先順位が与えられます。

source: A label can be used to "name" a loop for Continue and Break.
ja: ラベルは、Continueや Breakのループに「命名する」ために使うことができます。

source: A pointer-sized integer, equivalent to Int or Int64 depending on whether the exe running the script is 32-bit or 64-bit.
ja: ポインタサイズの整数で、スクリプトを実行するexeが32ビットか64ビットかに応じて、IntまたはInt64に相当します。

source: A reference to the function object is kept in the script's list of timers, and is not released unless the timer is deleted.
ja: 関数オブジェクトへの参照は、スクリプトのタイマーリストに保持され、タイマーが削除されない限り解放されない。

source: A timer that launches during the display of a DirSelect dialog will postpone the effect of the user's clicks inside the dialog until after the timer finishes.
ja: DirSelectダイアログの表示中に起動するタイマーは、ダイアログ内でのクリックの効果をタイマー終了後まで延期します。

source: A timer that launches during the display of a FileSelect dialog will postpone the effect of the user's clicks inside the dialog until after the timer finishes.
ja: ファイル選択ダイアログの表示中に起動するタイマーは、ダイアログ内でのクリックの効果をタイマー終了後まで延期します。

source: A variant type code which indicates the type of value contained by the COM wrapper object.
ja: COM ラッパーオブジェクトに含まれる値の種類を示すバリアントタイプコード。

source: A window group can be used to make a hotkey execute for a group of windows.
ja: ウィンドウグループを使用すると、ウィンドウのグループに対してホットキーを実行させることができます。

source: A for-loop can be used to iterate through the files:
ja: forループを使用して、ファイルを繰り返し処理することができます：

source: A parsing loop can also be used to examine each line or word one by one.
ja: 構文解析ループを使って、行や単語をひとつずつ調べることもできる。

source: A PropertyError is thrown if the object has no Hwnd property, or TypeError if it does not return a pure integer.
ja: オブジェクトにHwndプロパティがない場合はPropertyErrorが、純粋な整数を返さない場合はTypeErrorが投げられる。

source: A warning is displayed by default if any code cannot be executed due to a prior Return.
ja: 先行Returnにより実行できないコードがある場合、デフォルトで警告が表示されます。

source: A Prototype must also be created and assigned to the class before it can be instantiated with the standard Call method.
ja: また、標準的なCallメソッドでインスタンス化する前に、Prototypeを作成し、クラスに割り当てる必要があります。

source: A TypeError is thrown if either of the inputs is not a number or a numeric string.
ja: 入力のどちらかが数値または数値文字列でない場合、TypeErrorがスローされる。

source: A Str argument must not be an expression that evaluates to a number (such as i+1).
ja: Str引数は、数値（i+1など）に評価される式であってはならない。

source: A boolean value can be either true or false.
ja: ブーリアン値は、trueまたはfalseのいずれかになります。

source: A closure is a nested function bound to a set of free variables.
ja: クロージャとは、自由変数の集合に束縛されたネストされた関数のことです。
